MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 200, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=400, out_features=500, bias=True)
      (linear2): Linear(in_features=500, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2248, out_features=500, bias=True)
    (linear2): Linear(in_features=500, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=500, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=200, out_features=500, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=500, out_features=500, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=500, out_features=500, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=500, out_features=500, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=500, out_features=500, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.5, inplace=False)
    (3): Linear(in_features=500, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.016483, Train acc 0.74, Train aoc 0.81 | Valid Loss 0.023994 Valid acc 0.55, Valid aoc 0.60
Epoch 1 | Train Loss 0.015502, Train acc 0.77, Train aoc 0.84 | Valid Loss 0.023131 Valid acc 0.57, Valid aoc 0.62
Epoch 2 | Train Loss 0.013823, Train acc 0.78, Train aoc 0.87 | Valid Loss 0.027778 Valid acc 0.56, Valid aoc 0.64
Epoch 3 | Train Loss 0.012782, Train acc 0.79, Train aoc 0.88 | Valid Loss 0.031308 Valid acc 0.59, Valid aoc 0.64
Epoch 4 | Train Loss 0.011926, Train acc 0.83, Train aoc 0.91 | Valid Loss 0.025637 Valid acc 0.62, Valid aoc 0.64
Epoch 5 | Train Loss 0.010047, Train acc 0.85, Train aoc 0.93 | Valid Loss 0.042304 Valid acc 0.61, Valid aoc 0.66
Epoch 6 | Train Loss 0.009355, Train acc 0.86, Train aoc 0.94 | Valid Loss 0.045705 Valid acc 0.62, Valid aoc 0.65
Epoch 7 | Train Loss 0.008571, Train acc 0.87, Train aoc 0.96 | Valid Loss 0.044988 Valid acc 0.59, Valid aoc 0.66
Epoch 8 | Train Loss 0.007325, Train acc 0.90, Train aoc 0.96 | Valid Loss 0.064229 Valid acc 0.62, Valid aoc 0.66
Epoch 9 | Train Loss 0.006321, Train acc 0.92, Train aoc 0.97 | Valid Loss 0.062734 Valid acc 0.61, Valid aoc 0.65
Epoch 10 | Train Loss 0.005794, Train acc 0.93, Train aoc 0.98 | Valid Loss 0.055848 Valid acc 0.60, Valid aoc 0.65
Epoch 11 | Train Loss 0.005292, Train acc 0.93, Train aoc 0.98 | Valid Loss 0.074473 Valid acc 0.61, Valid aoc 0.65
Epoch 12 | Train Loss 0.004226, Train acc 0.94, Train aoc 0.99 | Valid Loss 0.081139 Valid acc 0.60, Valid aoc 0.65
Epoch 13 | Train Loss 0.003799, Train acc 0.95, Train aoc 0.99 | Valid Loss 0.122352 Valid acc 0.61, Valid aoc 0.64
Epoch 14 | Train Loss 0.003524, Train acc 0.96, Train aoc 0.99 | Valid Loss 0.127128 Valid acc 0.62, Valid aoc 0.66
Epoch 15 | Train Loss 0.003378, Train acc 0.96, Train aoc 0.99 | Valid Loss 0.123008 Valid acc 0.61, Valid aoc 0.65
Epoch 16 | Train Loss 0.003357, Train acc 0.96, Train aoc 0.99 | Valid Loss 0.139066 Valid acc 0.61, Valid aoc 0.64
Epoch 17 | Train Loss 0.002653, Train acc 0.97, Train aoc 1.00 | Valid Loss 0.156317 Valid acc 0.63, Valid aoc 0.66
Epoch 18 | Train Loss 0.002181, Train acc 0.97, Train aoc 1.00 | Valid Loss 0.174901 Valid acc 0.59, Valid aoc 0.65
Epoch 19 | Train Loss 0.002307, Train acc 0.97, Train aoc 1.00 | Valid Loss 0.250949 Valid acc 0.60, Valid aoc 0.64
