MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9051, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
      (3): Linear(in_features=100, out_features=100, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
      (3): Linear(in_features=100, out_features=100, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.002778, Train acc 0.64, Train aoc 0.65 | Valid Loss 0.003649 Valid acc 0.63, Valid aoc 0.46
Epoch 1 | Train Loss 0.002647, Train acc 0.65, Train aoc 0.71 | Valid Loss 0.003702 Valid acc 0.63, Valid aoc 0.45
Epoch 2 | Train Loss 0.002356, Train acc 0.73, Train aoc 0.77 | Valid Loss 0.003871 Valid acc 0.59, Valid aoc 0.53
Epoch 3 | Train Loss 0.002230, Train acc 0.75, Train aoc 0.81 | Valid Loss 0.003932 Valid acc 0.57, Valid aoc 0.53
Epoch 4 | Train Loss 0.002147, Train acc 0.77, Train aoc 0.83 | Valid Loss 0.003988 Valid acc 0.56, Valid aoc 0.54
Epoch 5 | Train Loss 0.002031, Train acc 0.78, Train aoc 0.84 | Valid Loss 0.004059 Valid acc 0.58, Valid aoc 0.54
Epoch 6 | Train Loss 0.001976, Train acc 0.79, Train aoc 0.86 | Valid Loss 0.004202 Valid acc 0.58, Valid aoc 0.53
Epoch 7 | Train Loss 0.001916, Train acc 0.80, Train aoc 0.87 | Valid Loss 0.004005 Valid acc 0.57, Valid aoc 0.54
Epoch 8 | Train Loss 0.001808, Train acc 0.81, Train aoc 0.88 | Valid Loss 0.004325 Valid acc 0.58, Valid aoc 0.54
Epoch 9 | Train Loss 0.001775, Train acc 0.81, Train aoc 0.89 | Valid Loss 0.004120 Valid acc 0.58, Valid aoc 0.56
