MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 50, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=100, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=50, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=50, out_features=50, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=100, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=50, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=50, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018294, Train acc 0.70, Train aoc 0.73 | Valid Loss 0.020677 Valid acc 0.63, Valid aoc 0.57
Epoch 1 | Train Loss 0.016830, Train acc 0.73, Train aoc 0.78 | Valid Loss 0.021204 Valid acc 0.61, Valid aoc 0.57
Epoch 2 | Train Loss 0.016845, Train acc 0.73, Train aoc 0.79 | Valid Loss 0.020965 Valid acc 0.62, Valid aoc 0.57
