MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9581, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=50, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=50, out_features=50, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=75, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=50, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018809, Train acc 0.68, Train aoc 0.70 | Valid Loss 0.020978 Valid acc 0.63, Valid aoc 0.56
Epoch 1 | Train Loss 0.017096, Train acc 0.72, Train aoc 0.78 | Valid Loss 0.020745 Valid acc 0.63, Valid aoc 0.58
Epoch 2 | Train Loss 0.016032, Train acc 0.75, Train aoc 0.80 | Valid Loss 0.023182 Valid acc 0.58, Valid aoc 0.57
Epoch 3 | Train Loss 0.015716, Train acc 0.75, Train aoc 0.81 | Valid Loss 0.022406 Valid acc 0.60, Valid aoc 0.59
Epoch 4 | Train Loss 0.015231, Train acc 0.76, Train aoc 0.83 | Valid Loss 0.021875 Valid acc 0.61, Valid aoc 0.57
Epoch 5 | Train Loss 0.015245, Train acc 0.76, Train aoc 0.84 | Valid Loss 0.021002 Valid acc 0.61, Valid aoc 0.59
Epoch 6 | Train Loss 0.014774, Train acc 0.76, Train aoc 0.84 | Valid Loss 0.023158 Valid acc 0.61, Valid aoc 0.59
Epoch 7 | Train Loss 0.014062, Train acc 0.78, Train aoc 0.86 | Valid Loss 0.024874 Valid acc 0.62, Valid aoc 0.56
Epoch 8 | Train Loss 0.013799, Train acc 0.79, Train aoc 0.87 | Valid Loss 0.022578 Valid acc 0.61, Valid aoc 0.58
Epoch 9 | Train Loss 0.013431, Train acc 0.80, Train aoc 0.87 | Valid Loss 0.022506 Valid acc 0.61, Valid aoc 0.58
Epoch 10 | Train Loss 0.012887, Train acc 0.81, Train aoc 0.88 | Valid Loss 0.022805 Valid acc 0.61, Valid aoc 0.59
Epoch 11 | Train Loss 0.012444, Train acc 0.81, Train aoc 0.89 | Valid Loss 0.024579 Valid acc 0.62, Valid aoc 0.58
Epoch 12 | Train Loss 0.012727, Train acc 0.81, Train aoc 0.89 | Valid Loss 0.023121 Valid acc 0.59, Valid aoc 0.57
Epoch 13 | Train Loss 0.012325, Train acc 0.81, Train aoc 0.90 | Valid Loss 0.026660 Valid acc 0.61, Valid aoc 0.57
Epoch 14 | Train Loss 0.011166, Train acc 0.84, Train aoc 0.91 | Valid Loss 0.026164 Valid acc 0.61, Valid aoc 0.58
Epoch 15 | Train Loss 0.010732, Train acc 0.84, Train aoc 0.92 | Valid Loss 0.027813 Valid acc 0.58, Valid aoc 0.56
Epoch 16 | Train Loss 0.010785, Train acc 0.84, Train aoc 0.92 | Valid Loss 0.027086 Valid acc 0.62, Valid aoc 0.57
Epoch 17 | Train Loss 0.010068, Train acc 0.85, Train aoc 0.93 | Valid Loss 0.029772 Valid acc 0.61, Valid aoc 0.57
Epoch 18 | Train Loss 0.009610, Train acc 0.87, Train aoc 0.94 | Valid Loss 0.028987 Valid acc 0.60, Valid aoc 0.58
Epoch 19 | Train Loss 0.009529, Train acc 0.86, Train aoc 0.94 | Valid Loss 0.029921 Valid acc 0.59, Valid aoc 0.55
