MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9051, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=50, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=50, out_features=50, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=75, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=50, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.002825, Train acc 0.64, Train aoc 0.57 | Valid Loss 0.003629 Valid acc 0.63, Valid aoc 0.51
Epoch 1 | Train Loss 0.002722, Train acc 0.64, Train aoc 0.68 | Valid Loss 0.003594 Valid acc 0.63, Valid aoc 0.54
Epoch 2 | Train Loss 0.002487, Train acc 0.71, Train aoc 0.76 | Valid Loss 0.003609 Valid acc 0.61, Valid aoc 0.54
Epoch 3 | Train Loss 0.002396, Train acc 0.74, Train aoc 0.79 | Valid Loss 0.003586 Valid acc 0.63, Valid aoc 0.56
Epoch 4 | Train Loss 0.002209, Train acc 0.75, Train aoc 0.82 | Valid Loss 0.003646 Valid acc 0.59, Valid aoc 0.56
Epoch 5 | Train Loss 0.002091, Train acc 0.76, Train aoc 0.83 | Valid Loss 0.003917 Valid acc 0.60, Valid aoc 0.57
Epoch 6 | Train Loss 0.002067, Train acc 0.76, Train aoc 0.85 | Valid Loss 0.003883 Valid acc 0.60, Valid aoc 0.57
Epoch 7 | Train Loss 0.001949, Train acc 0.78, Train aoc 0.87 | Valid Loss 0.003892 Valid acc 0.61, Valid aoc 0.57
Epoch 8 | Train Loss 0.001994, Train acc 0.77, Train aoc 0.87 | Valid Loss 0.004240 Valid acc 0.62, Valid aoc 0.57
Epoch 9 | Train Loss 0.001820, Train acc 0.80, Train aoc 0.89 | Valid Loss 0.003857 Valid acc 0.60, Valid aoc 0.57
Epoch 10 | Train Loss 0.001717, Train acc 0.81, Train aoc 0.90 | Valid Loss 0.004197 Valid acc 0.61, Valid aoc 0.58
Epoch 11 | Train Loss 0.001602, Train acc 0.82, Train aoc 0.91 | Valid Loss 0.004318 Valid acc 0.60, Valid aoc 0.58
Epoch 12 | Train Loss 0.001551, Train acc 0.83, Train aoc 0.92 | Valid Loss 0.004328 Valid acc 0.61, Valid aoc 0.59
Epoch 13 | Train Loss 0.001419, Train acc 0.85, Train aoc 0.93 | Valid Loss 0.004466 Valid acc 0.62, Valid aoc 0.60
Epoch 14 | Train Loss 0.001330, Train acc 0.85, Train aoc 0.94 | Valid Loss 0.005104 Valid acc 0.58, Valid aoc 0.59
Epoch 15 | Train Loss 0.001259, Train acc 0.87, Train aoc 0.95 | Valid Loss 0.005299 Valid acc 0.60, Valid aoc 0.59
Epoch 16 | Train Loss 0.001261, Train acc 0.87, Train aoc 0.95 | Valid Loss 0.005082 Valid acc 0.61, Valid aoc 0.58
Epoch 17 | Train Loss 0.001074, Train acc 0.89, Train aoc 0.96 | Valid Loss 0.005493 Valid acc 0.61, Valid aoc 0.59
Epoch 18 | Train Loss 0.000959, Train acc 0.91, Train aoc 0.97 | Valid Loss 0.006502 Valid acc 0.61, Valid aoc 0.59
Epoch 19 | Train Loss 0.000888, Train acc 0.92, Train aoc 0.97 | Valid Loss 0.007052 Valid acc 0.59, Valid aoc 0.58
