MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018705, Train acc 0.69, Train aoc 0.74 | Valid Loss 0.020683 Valid acc 0.62, Valid aoc 0.54
Epoch 1 | Train Loss 0.016904, Train acc 0.73, Train aoc 0.79 | Valid Loss 0.021391 Valid acc 0.62, Valid aoc 0.54
Epoch 2 | Train Loss 0.015914, Train acc 0.75, Train aoc 0.81 | Valid Loss 0.022745 Valid acc 0.63, Valid aoc 0.55
Epoch 3 | Train Loss 0.014720, Train acc 0.77, Train aoc 0.85 | Valid Loss 0.022628 Valid acc 0.61, Valid aoc 0.57
Epoch 4 | Train Loss 0.014280, Train acc 0.79, Train aoc 0.87 | Valid Loss 0.021495 Valid acc 0.60, Valid aoc 0.57
Epoch 5 | Train Loss 0.013392, Train acc 0.80, Train aoc 0.89 | Valid Loss 0.023383 Valid acc 0.62, Valid aoc 0.58
Epoch 6 | Train Loss 0.012088, Train acc 0.82, Train aoc 0.90 | Valid Loss 0.024149 Valid acc 0.60, Valid aoc 0.56
Epoch 7 | Train Loss 0.010928, Train acc 0.83, Train aoc 0.92 | Valid Loss 0.029515 Valid acc 0.61, Valid aoc 0.57
Epoch 8 | Train Loss 0.011006, Train acc 0.85, Train aoc 0.93 | Valid Loss 0.024892 Valid acc 0.58, Valid aoc 0.58
Epoch 9 | Train Loss 0.010097, Train acc 0.86, Train aoc 0.94 | Valid Loss 0.027075 Valid acc 0.60, Valid aoc 0.57
Epoch 10 | Train Loss 0.009645, Train acc 0.87, Train aoc 0.95 | Valid Loss 0.028445 Valid acc 0.58, Valid aoc 0.57
Epoch 11 | Train Loss 0.008629, Train acc 0.88, Train aoc 0.96 | Valid Loss 0.034289 Valid acc 0.60, Valid aoc 0.56
Epoch 12 | Train Loss 0.008498, Train acc 0.89, Train aoc 0.96 | Valid Loss 0.031137 Valid acc 0.60, Valid aoc 0.57
Epoch 13 | Train Loss 0.008184, Train acc 0.89, Train aoc 0.96 | Valid Loss 0.039407 Valid acc 0.56, Valid aoc 0.55
Epoch 14 | Train Loss 0.007177, Train acc 0.91, Train aoc 0.97 | Valid Loss 0.040170 Valid acc 0.60, Valid aoc 0.56
Epoch 15 | Train Loss 0.007205, Train acc 0.92, Train aoc 0.98 | Valid Loss 0.042230 Valid acc 0.60, Valid aoc 0.57
Epoch 16 | Train Loss 0.006249, Train acc 0.92, Train aoc 0.98 | Valid Loss 0.052209 Valid acc 0.60, Valid aoc 0.57
Epoch 17 | Train Loss 0.005938, Train acc 0.93, Train aoc 0.98 | Valid Loss 0.057480 Valid acc 0.59, Valid aoc 0.57
Epoch 18 | Train Loss 0.006129, Train acc 0.93, Train aoc 0.98 | Valid Loss 0.047540 Valid acc 0.59, Valid aoc 0.56
Epoch 19 | Train Loss 0.005710, Train acc 0.93, Train aoc 0.98 | Valid Loss 0.066213 Valid acc 0.59, Valid aoc 0.57
