MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=10, bias=True)
      (linear2): Linear(in_features=10, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=10, bias=True)
    (linear2): Linear(in_features=10, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=10, out_features=10, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=10, out_features=10, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=10, out_features=10, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=10, out_features=10, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.8, inplace=False)
    (3): Linear(in_features=10, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.020410, Train acc 0.64, Train aoc 0.58 | Valid Loss 0.020750 Valid acc 0.63, Valid aoc 0.50
Epoch 1 | Train Loss 0.020375, Train acc 0.64, Train aoc 0.56 | Valid Loss 0.020737 Valid acc 0.63, Valid aoc 0.49
Epoch 2 | Train Loss 0.020359, Train acc 0.64, Train aoc 0.62 | Valid Loss 0.020736 Valid acc 0.63, Valid aoc 0.51
Epoch 3 | Train Loss 0.020318, Train acc 0.64, Train aoc 0.66 | Valid Loss 0.020730 Valid acc 0.63, Valid aoc 0.53
Epoch 4 | Train Loss 0.020182, Train acc 0.64, Train aoc 0.69 | Valid Loss 0.020709 Valid acc 0.63, Valid aoc 0.54
Epoch 5 | Train Loss 0.019959, Train acc 0.64, Train aoc 0.71 | Valid Loss 0.020674 Valid acc 0.63, Valid aoc 0.54
Epoch 6 | Train Loss 0.019731, Train acc 0.64, Train aoc 0.73 | Valid Loss 0.020645 Valid acc 0.63, Valid aoc 0.54
Epoch 7 | Train Loss 0.018832, Train acc 0.69, Train aoc 0.75 | Valid Loss 0.020603 Valid acc 0.64, Valid aoc 0.56
Epoch 8 | Train Loss 0.018722, Train acc 0.70, Train aoc 0.74 | Valid Loss 0.020719 Valid acc 0.63, Valid aoc 0.50
Epoch 9 | Train Loss 0.018415, Train acc 0.70, Train aoc 0.73 | Valid Loss 0.020783 Valid acc 0.64, Valid aoc 0.55
Epoch 10 | Train Loss 0.017880, Train acc 0.73, Train aoc 0.72 | Valid Loss 0.020975 Valid acc 0.63, Valid aoc 0.52
Epoch 11 | Train Loss 0.017065, Train acc 0.77, Train aoc 0.74 | Valid Loss 0.021383 Valid acc 0.61, Valid aoc 0.53
Epoch 12 | Train Loss 0.016786, Train acc 0.77, Train aoc 0.74 | Valid Loss 0.021828 Valid acc 0.61, Valid aoc 0.52
Epoch 13 | Train Loss 0.016466, Train acc 0.78, Train aoc 0.75 | Valid Loss 0.022100 Valid acc 0.61, Valid aoc 0.54
Epoch 14 | Train Loss 0.016379, Train acc 0.78, Train aoc 0.75 | Valid Loss 0.021980 Valid acc 0.63, Valid aoc 0.51
Epoch 15 | Train Loss 0.016085, Train acc 0.79, Train aoc 0.76 | Valid Loss 0.022730 Valid acc 0.62, Valid aoc 0.52
Epoch 16 | Train Loss 0.015978, Train acc 0.79, Train aoc 0.77 | Valid Loss 0.022749 Valid acc 0.62, Valid aoc 0.52
