MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9400, 200, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=400, out_features=500, bias=True)
      (linear2): Linear(in_features=500, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2248, out_features=500, bias=True)
    (linear2): Linear(in_features=500, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=500, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=200, out_features=500, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=500, out_features=500, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=500, out_features=500, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=500, out_features=500, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=500, out_features=500, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.5, inplace=False)
    (3): Linear(in_features=500, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.016724, Train acc 0.73, Train aoc 0.79 | Valid Loss 0.026390 Valid acc 0.55, Valid aoc 0.61
Epoch 1 | Train Loss 0.016327, Train acc 0.74, Train aoc 0.80 | Valid Loss 0.026963 Valid acc 0.54, Valid aoc 0.63
Epoch 2 | Train Loss 0.015313, Train acc 0.76, Train aoc 0.83 | Valid Loss 0.024050 Valid acc 0.56, Valid aoc 0.63
Epoch 3 | Train Loss 0.015005, Train acc 0.78, Train aoc 0.85 | Valid Loss 0.023566 Valid acc 0.58, Valid aoc 0.62
Epoch 4 | Train Loss 0.014039, Train acc 0.79, Train aoc 0.86 | Valid Loss 0.028403 Valid acc 0.57, Valid aoc 0.62
Epoch 5 | Train Loss 0.013609, Train acc 0.80, Train aoc 0.87 | Valid Loss 0.028575 Valid acc 0.56, Valid aoc 0.62
Epoch 6 | Train Loss 0.013519, Train acc 0.80, Train aoc 0.88 | Valid Loss 0.026095 Valid acc 0.57, Valid aoc 0.63
Epoch 7 | Train Loss 0.012807, Train acc 0.80, Train aoc 0.89 | Valid Loss 0.026914 Valid acc 0.56, Valid aoc 0.63
Epoch 8 | Train Loss 0.012285, Train acc 0.82, Train aoc 0.90 | Valid Loss 0.040978 Valid acc 0.57, Valid aoc 0.61
Epoch 9 | Train Loss 0.012136, Train acc 0.82, Train aoc 0.90 | Valid Loss 0.046573 Valid acc 0.58, Valid aoc 0.61
Epoch 10 | Train Loss 0.011368, Train acc 0.83, Train aoc 0.91 | Valid Loss 0.032542 Valid acc 0.57, Valid aoc 0.61
Epoch 11 | Train Loss 0.010987, Train acc 0.83, Train aoc 0.92 | Valid Loss 0.038204 Valid acc 0.60, Valid aoc 0.62
Epoch 12 | Train Loss 0.010620, Train acc 0.84, Train aoc 0.92 | Valid Loss 0.039273 Valid acc 0.56, Valid aoc 0.60
Epoch 13 | Train Loss 0.010167, Train acc 0.84, Train aoc 0.93 | Valid Loss 0.040457 Valid acc 0.60, Valid aoc 0.62
Epoch 14 | Train Loss 0.009976, Train acc 0.84, Train aoc 0.93 | Valid Loss 0.042515 Valid acc 0.57, Valid aoc 0.60
Epoch 15 | Train Loss 0.009839, Train acc 0.84, Train aoc 0.93 | Valid Loss 0.049696 Valid acc 0.56, Valid aoc 0.59
Epoch 16 | Train Loss 0.009570, Train acc 0.85, Train aoc 0.93 | Valid Loss 0.056605 Valid acc 0.55, Valid aoc 0.59
Epoch 17 | Train Loss 0.009379, Train acc 0.85, Train aoc 0.94 | Valid Loss 0.051405 Valid acc 0.57, Valid aoc 0.60
Epoch 18 | Train Loss 0.009426, Train acc 0.85, Train aoc 0.94 | Valid Loss 0.043052 Valid acc 0.57, Valid aoc 0.60
Epoch 19 | Train Loss 0.008977, Train acc 0.86, Train aoc 0.94 | Valid Loss 0.055244 Valid acc 0.55, Valid aoc 0.59
