MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9403, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=10, bias=True)
      (linear2): Linear(in_features=10, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=10, bias=True)
    (linear2): Linear(in_features=10, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=10, out_features=10, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=10, out_features=10, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=10, out_features=10, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=10, out_features=10, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.8, inplace=False)
    (3): Linear(in_features=10, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.021534, Train acc 0.64, Train aoc 0.59 | Valid Loss 0.021683 Valid acc 0.63, Valid aoc 0.51
Epoch 1 | Train Loss 0.020742, Train acc 0.64, Train aoc 0.56 | Valid Loss 0.020989 Valid acc 0.63, Valid aoc 0.52
Epoch 2 | Train Loss 0.020568, Train acc 0.64, Train aoc 0.53 | Valid Loss 0.020852 Valid acc 0.63, Valid aoc 0.53
Epoch 3 | Train Loss 0.020440, Train acc 0.64, Train aoc 0.61 | Valid Loss 0.020764 Valid acc 0.63, Valid aoc 0.55
Epoch 4 | Train Loss 0.020383, Train acc 0.64, Train aoc 0.66 | Valid Loss 0.020736 Valid acc 0.63, Valid aoc 0.56
Epoch 5 | Train Loss 0.020202, Train acc 0.64, Train aoc 0.67 | Valid Loss 0.020680 Valid acc 0.63, Valid aoc 0.55
Epoch 6 | Train Loss 0.019730, Train acc 0.64, Train aoc 0.69 | Valid Loss 0.020596 Valid acc 0.63, Valid aoc 0.55
Epoch 7 | Train Loss 0.019524, Train acc 0.64, Train aoc 0.70 | Valid Loss 0.020589 Valid acc 0.63, Valid aoc 0.56
Epoch 8 | Train Loss 0.019291, Train acc 0.64, Train aoc 0.71 | Valid Loss 0.020693 Valid acc 0.63, Valid aoc 0.56
Epoch 9 | Train Loss 0.019284, Train acc 0.64, Train aoc 0.71 | Valid Loss 0.020637 Valid acc 0.63, Valid aoc 0.56
Epoch 10 | Train Loss 0.019257, Train acc 0.64, Train aoc 0.71 | Valid Loss 0.020625 Valid acc 0.63, Valid aoc 0.56
Epoch 11 | Train Loss 0.019035, Train acc 0.64, Train aoc 0.72 | Valid Loss 0.020736 Valid acc 0.63, Valid aoc 0.56
Epoch 12 | Train Loss 0.018966, Train acc 0.64, Train aoc 0.71 | Valid Loss 0.020808 Valid acc 0.63, Valid aoc 0.56
Epoch 13 | Train Loss 0.018782, Train acc 0.64, Train aoc 0.72 | Valid Loss 0.021062 Valid acc 0.63, Valid aoc 0.56
Epoch 14 | Train Loss 0.018814, Train acc 0.64, Train aoc 0.72 | Valid Loss 0.020911 Valid acc 0.63, Valid aoc 0.57
Epoch 15 | Train Loss 0.018725, Train acc 0.64, Train aoc 0.72 | Valid Loss 0.021005 Valid acc 0.63, Valid aoc 0.57
Epoch 16 | Train Loss 0.018751, Train acc 0.64, Train aoc 0.72 | Valid Loss 0.020998 Valid acc 0.63, Valid aoc 0.57
Epoch 17 | Train Loss 0.018804, Train acc 0.64, Train aoc 0.72 | Valid Loss 0.020917 Valid acc 0.63, Valid aoc 0.57
Epoch 18 | Train Loss 0.018617, Train acc 0.64, Train aoc 0.73 | Valid Loss 0.021081 Valid acc 0.63, Valid aoc 0.57
Epoch 19 | Train Loss 0.018740, Train acc 0.64, Train aoc 0.73 | Valid Loss 0.020802 Valid acc 0.63, Valid aoc 0.57
