MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=10, bias=True)
      (linear2): Linear(in_features=10, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): Tanh()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=10, bias=True)
    (linear2): Linear(in_features=10, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=10, out_features=10, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.8, inplace=False)
    (3): Linear(in_features=10, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.020621, Train acc 0.64, Train aoc 0.62 | Valid Loss 0.020946 Valid acc 0.63, Valid aoc 0.50
Epoch 1 | Train Loss 0.020296, Train acc 0.64, Train aoc 0.67 | Valid Loss 0.020733 Valid acc 0.63, Valid aoc 0.53
Epoch 2 | Train Loss 0.020109, Train acc 0.64, Train aoc 0.70 | Valid Loss 0.020692 Valid acc 0.63, Valid aoc 0.53
Epoch 3 | Train Loss 0.019716, Train acc 0.64, Train aoc 0.75 | Valid Loss 0.020639 Valid acc 0.63, Valid aoc 0.55
Epoch 4 | Train Loss 0.019434, Train acc 0.64, Train aoc 0.76 | Valid Loss 0.020629 Valid acc 0.63, Valid aoc 0.56
Epoch 5 | Train Loss 0.019033, Train acc 0.64, Train aoc 0.77 | Valid Loss 0.020666 Valid acc 0.63, Valid aoc 0.55
Epoch 6 | Train Loss 0.018919, Train acc 0.64, Train aoc 0.78 | Valid Loss 0.020651 Valid acc 0.63, Valid aoc 0.55
Epoch 7 | Train Loss 0.018330, Train acc 0.64, Train aoc 0.79 | Valid Loss 0.020803 Valid acc 0.63, Valid aoc 0.55
Epoch 8 | Train Loss 0.017996, Train acc 0.64, Train aoc 0.79 | Valid Loss 0.020882 Valid acc 0.63, Valid aoc 0.55
Epoch 9 | Train Loss 0.017669, Train acc 0.64, Train aoc 0.80 | Valid Loss 0.021055 Valid acc 0.63, Valid aoc 0.55
Epoch 10 | Train Loss 0.017455, Train acc 0.64, Train aoc 0.81 | Valid Loss 0.021110 Valid acc 0.63, Valid aoc 0.55
Epoch 11 | Train Loss 0.016873, Train acc 0.64, Train aoc 0.81 | Valid Loss 0.021678 Valid acc 0.63, Valid aoc 0.56
Epoch 12 | Train Loss 0.016607, Train acc 0.64, Train aoc 0.82 | Valid Loss 0.021932 Valid acc 0.63, Valid aoc 0.56
Epoch 13 | Train Loss 0.016379, Train acc 0.64, Train aoc 0.83 | Valid Loss 0.022238 Valid acc 0.63, Valid aoc 0.56
Epoch 14 | Train Loss 0.015960, Train acc 0.64, Train aoc 0.83 | Valid Loss 0.022821 Valid acc 0.63, Valid aoc 0.56
Epoch 15 | Train Loss 0.015688, Train acc 0.64, Train aoc 0.84 | Valid Loss 0.022867 Valid acc 0.63, Valid aoc 0.56
Epoch 16 | Train Loss 0.015590, Train acc 0.64, Train aoc 0.84 | Valid Loss 0.022723 Valid acc 0.63, Valid aoc 0.56
Epoch 17 | Train Loss 0.015371, Train acc 0.64, Train aoc 0.85 | Valid Loss 0.023389 Valid acc 0.63, Valid aoc 0.56
Epoch 18 | Train Loss 0.015103, Train acc 0.64, Train aoc 0.85 | Valid Loss 0.024198 Valid acc 0.63, Valid aoc 0.56
Epoch 19 | Train Loss 0.014843, Train acc 0.64, Train aoc 0.85 | Valid Loss 0.025202 Valid acc 0.63, Valid aoc 0.55
