MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9400, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=True)
      (3): Linear(in_features=100, out_features=100, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.8, inplace=True)
      (6): Linear(in_features=100, out_features=100, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.8, inplace=True)
      (9): Linear(in_features=100, out_features=100, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.8, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.8, inplace=False)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.020653, Train acc 0.64, Train aoc 0.65 | Valid Loss 0.022399 Valid acc 0.51, Valid aoc 0.56
Epoch 1 | Train Loss 0.020536, Train acc 0.64, Train aoc 0.67 | Valid Loss 0.022402 Valid acc 0.51, Valid aoc 0.56
Epoch 2 | Train Loss 0.020550, Train acc 0.64, Train aoc 0.69 | Valid Loss 0.022305 Valid acc 0.51, Valid aoc 0.58
Epoch 3 | Train Loss 0.020427, Train acc 0.64, Train aoc 0.71 | Valid Loss 0.022143 Valid acc 0.51, Valid aoc 0.60
Epoch 4 | Train Loss 0.020029, Train acc 0.64, Train aoc 0.72 | Valid Loss 0.022062 Valid acc 0.51, Valid aoc 0.60
Epoch 5 | Train Loss 0.020263, Train acc 0.64, Train aoc 0.74 | Valid Loss 0.022001 Valid acc 0.51, Valid aoc 0.60
Epoch 6 | Train Loss 0.019908, Train acc 0.64, Train aoc 0.74 | Valid Loss 0.021918 Valid acc 0.51, Valid aoc 0.60
Epoch 7 | Train Loss 0.019762, Train acc 0.64, Train aoc 0.74 | Valid Loss 0.021878 Valid acc 0.51, Valid aoc 0.60
Epoch 8 | Train Loss 0.019801, Train acc 0.64, Train aoc 0.75 | Valid Loss 0.021834 Valid acc 0.51, Valid aoc 0.60
Epoch 9 | Train Loss 0.019964, Train acc 0.71, Train aoc 0.75 | Valid Loss 0.021824 Valid acc 0.57, Valid aoc 0.60
Epoch 10 | Train Loss 0.019682, Train acc 0.71, Train aoc 0.75 | Valid Loss 0.021843 Valid acc 0.56, Valid aoc 0.60
Epoch 11 | Train Loss 0.019981, Train acc 0.71, Train aoc 0.76 | Valid Loss 0.021799 Valid acc 0.56, Valid aoc 0.60
Epoch 12 | Train Loss 0.019411, Train acc 0.71, Train aoc 0.75 | Valid Loss 0.021808 Valid acc 0.56, Valid aoc 0.60
Epoch 13 | Train Loss 0.020083, Train acc 0.69, Train aoc 0.76 | Valid Loss 0.021769 Valid acc 0.57, Valid aoc 0.60
Epoch 14 | Train Loss 0.020192, Train acc 0.70, Train aoc 0.76 | Valid Loss 0.021820 Valid acc 0.56, Valid aoc 0.60
Epoch 15 | Train Loss 0.019851, Train acc 0.70, Train aoc 0.77 | Valid Loss 0.021783 Valid acc 0.55, Valid aoc 0.60
Epoch 16 | Train Loss 0.019340, Train acc 0.71, Train aoc 0.77 | Valid Loss 0.021740 Valid acc 0.55, Valid aoc 0.60
Epoch 17 | Train Loss 0.019501, Train acc 0.71, Train aoc 0.77 | Valid Loss 0.021753 Valid acc 0.55, Valid aoc 0.60
