MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018567, Train acc 0.69, Train aoc 0.72 | Valid Loss 0.020743 Valid acc 0.63, Valid aoc 0.54
Epoch 1 | Train Loss 0.017179, Train acc 0.74, Train aoc 0.77 | Valid Loss 0.021108 Valid acc 0.61, Valid aoc 0.55
Epoch 2 | Train Loss 0.016288, Train acc 0.75, Train aoc 0.80 | Valid Loss 0.021349 Valid acc 0.62, Valid aoc 0.55
Epoch 3 | Train Loss 0.015466, Train acc 0.76, Train aoc 0.84 | Valid Loss 0.021630 Valid acc 0.63, Valid aoc 0.57
Epoch 4 | Train Loss 0.014519, Train acc 0.78, Train aoc 0.86 | Valid Loss 0.021602 Valid acc 0.62, Valid aoc 0.57
Epoch 5 | Train Loss 0.013891, Train acc 0.80, Train aoc 0.87 | Valid Loss 0.022124 Valid acc 0.61, Valid aoc 0.56
Epoch 6 | Train Loss 0.013148, Train acc 0.81, Train aoc 0.89 | Valid Loss 0.022575 Valid acc 0.59, Valid aoc 0.56
