MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=200, bias=True)
      (linear2): Linear(in_features=200, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=200, bias=True)
    (linear2): Linear(in_features=200, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=200, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=200, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=200, out_features=200, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=200, out_features=200, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=200, out_features=200, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=200, out_features=200, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.5, inplace=False)
    (3): Linear(in_features=200, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.019214, Train acc 0.68, Train aoc 0.73 | Valid Loss 0.028673 Valid acc 0.53, Valid aoc 0.60
Epoch 1 | Train Loss 0.018097, Train acc 0.72, Train aoc 0.74 | Valid Loss 0.022469 Valid acc 0.55, Valid aoc 0.60
Epoch 2 | Train Loss 0.017604, Train acc 0.72, Train aoc 0.75 | Valid Loss 0.023119 Valid acc 0.56, Valid aoc 0.60
Epoch 3 | Train Loss 0.017398, Train acc 0.73, Train aoc 0.76 | Valid Loss 0.027015 Valid acc 0.55, Valid aoc 0.61
Epoch 4 | Train Loss 0.016967, Train acc 0.74, Train aoc 0.77 | Valid Loss 0.024196 Valid acc 0.55, Valid aoc 0.61
Epoch 5 | Train Loss 0.016737, Train acc 0.74, Train aoc 0.78 | Valid Loss 0.025130 Valid acc 0.55, Valid aoc 0.61
Epoch 6 | Train Loss 0.016739, Train acc 0.75, Train aoc 0.78 | Valid Loss 0.024380 Valid acc 0.55, Valid aoc 0.62
Epoch 7 | Train Loss 0.016409, Train acc 0.75, Train aoc 0.79 | Valid Loss 0.024584 Valid acc 0.54, Valid aoc 0.61
Epoch 8 | Train Loss 0.016412, Train acc 0.75, Train aoc 0.79 | Valid Loss 0.023942 Valid acc 0.55, Valid aoc 0.61
Epoch 9 | Train Loss 0.016180, Train acc 0.75, Train aoc 0.80 | Valid Loss 0.024756 Valid acc 0.55, Valid aoc 0.61
Epoch 10 | Train Loss 0.016137, Train acc 0.76, Train aoc 0.80 | Valid Loss 0.024478 Valid acc 0.56, Valid aoc 0.60
Epoch 11 | Train Loss 0.015941, Train acc 0.76, Train aoc 0.80 | Valid Loss 0.025506 Valid acc 0.55, Valid aoc 0.61
Epoch 12 | Train Loss 0.015850, Train acc 0.76, Train aoc 0.81 | Valid Loss 0.025876 Valid acc 0.56, Valid aoc 0.60
Epoch 13 | Train Loss 0.015681, Train acc 0.77, Train aoc 0.81 | Valid Loss 0.024694 Valid acc 0.54, Valid aoc 0.60
Epoch 14 | Train Loss 0.015784, Train acc 0.76, Train aoc 0.81 | Valid Loss 0.028638 Valid acc 0.54, Valid aoc 0.60
