MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9400, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=100, out_features=100, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=100, out_features=100, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=100, out_features=100, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.8, inplace=False)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018906, Train acc 0.64, Train aoc 0.71 | Valid Loss 0.022804 Valid acc 0.51, Valid aoc 0.59
Epoch 1 | Train Loss 0.018366, Train acc 0.70, Train aoc 0.73 | Valid Loss 0.023099 Valid acc 0.55, Valid aoc 0.60
Epoch 2 | Train Loss 0.018015, Train acc 0.71, Train aoc 0.75 | Valid Loss 0.022778 Valid acc 0.56, Valid aoc 0.60
Epoch 3 | Train Loss 0.017484, Train acc 0.73, Train aoc 0.75 | Valid Loss 0.024500 Valid acc 0.55, Valid aoc 0.61
Epoch 4 | Train Loss 0.017338, Train acc 0.73, Train aoc 0.76 | Valid Loss 0.024511 Valid acc 0.54, Valid aoc 0.61
Epoch 5 | Train Loss 0.017343, Train acc 0.74, Train aoc 0.77 | Valid Loss 0.022864 Valid acc 0.55, Valid aoc 0.61
Epoch 6 | Train Loss 0.017186, Train acc 0.74, Train aoc 0.77 | Valid Loss 0.023260 Valid acc 0.55, Valid aoc 0.60
Epoch 7 | Train Loss 0.016951, Train acc 0.75, Train aoc 0.78 | Valid Loss 0.023291 Valid acc 0.56, Valid aoc 0.62
Epoch 8 | Train Loss 0.016705, Train acc 0.75, Train aoc 0.78 | Valid Loss 0.023765 Valid acc 0.56, Valid aoc 0.62
Epoch 9 | Train Loss 0.016959, Train acc 0.75, Train aoc 0.78 | Valid Loss 0.022759 Valid acc 0.56, Valid aoc 0.62
Epoch 10 | Train Loss 0.016572, Train acc 0.75, Train aoc 0.78 | Valid Loss 0.025694 Valid acc 0.56, Valid aoc 0.62
Epoch 11 | Train Loss 0.016460, Train acc 0.75, Train aoc 0.79 | Valid Loss 0.024973 Valid acc 0.55, Valid aoc 0.62
Epoch 12 | Train Loss 0.016540, Train acc 0.75, Train aoc 0.79 | Valid Loss 0.023327 Valid acc 0.55, Valid aoc 0.61
Epoch 13 | Train Loss 0.016432, Train acc 0.75, Train aoc 0.79 | Valid Loss 0.024010 Valid acc 0.55, Valid aoc 0.60
Epoch 14 | Train Loss 0.016440, Train acc 0.76, Train aoc 0.79 | Valid Loss 0.023318 Valid acc 0.56, Valid aoc 0.61
Epoch 15 | Train Loss 0.016133, Train acc 0.76, Train aoc 0.80 | Valid Loss 0.025323 Valid acc 0.55, Valid aoc 0.62
Epoch 16 | Train Loss 0.016259, Train acc 0.76, Train aoc 0.80 | Valid Loss 0.023449 Valid acc 0.56, Valid aoc 0.62
Epoch 17 | Train Loss 0.015993, Train acc 0.76, Train aoc 0.80 | Valid Loss 0.025055 Valid acc 0.55, Valid aoc 0.62
Epoch 18 | Train Loss 0.016076, Train acc 0.76, Train aoc 0.80 | Valid Loss 0.024928 Valid acc 0.56, Valid aoc 0.62
Epoch 19 | Train Loss 0.015957, Train acc 0.76, Train aoc 0.81 | Valid Loss 0.023871 Valid acc 0.55, Valid aoc 0.62
