MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9400, 50, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=100, out_features=10, bias=True)
      (linear2): Linear(in_features=10, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2098, out_features=10, bias=True)
    (linear2): Linear(in_features=10, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=50, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=10, out_features=10, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=10, out_features=10, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=10, out_features=10, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=10, out_features=10, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.8, inplace=False)
    (3): Linear(in_features=10, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.020426, Train acc 0.64, Train aoc 0.55 | Valid Loss 0.022847 Valid acc 0.51, Valid aoc 0.49
Epoch 1 | Train Loss 0.020367, Train acc 0.64, Train aoc 0.58 | Valid Loss 0.023127 Valid acc 0.51, Valid aoc 0.52
Epoch 2 | Train Loss 0.020365, Train acc 0.64, Train aoc 0.60 | Valid Loss 0.023227 Valid acc 0.51, Valid aoc 0.55
Epoch 3 | Train Loss 0.020359, Train acc 0.64, Train aoc 0.62 | Valid Loss 0.023255 Valid acc 0.51, Valid aoc 0.55
Epoch 4 | Train Loss 0.020345, Train acc 0.64, Train aoc 0.64 | Valid Loss 0.023265 Valid acc 0.51, Valid aoc 0.55
Epoch 5 | Train Loss 0.020348, Train acc 0.64, Train aoc 0.65 | Valid Loss 0.023299 Valid acc 0.51, Valid aoc 0.55
Epoch 6 | Train Loss 0.020347, Train acc 0.64, Train aoc 0.65 | Valid Loss 0.023349 Valid acc 0.51, Valid aoc 0.56
Epoch 7 | Train Loss 0.020338, Train acc 0.64, Train aoc 0.66 | Valid Loss 0.023342 Valid acc 0.51, Valid aoc 0.56
Epoch 8 | Train Loss 0.020276, Train acc 0.64, Train aoc 0.67 | Valid Loss 0.023388 Valid acc 0.51, Valid aoc 0.57
Epoch 9 | Train Loss 0.020068, Train acc 0.64, Train aoc 0.67 | Valid Loss 0.023312 Valid acc 0.51, Valid aoc 0.57
Epoch 10 | Train Loss 0.019957, Train acc 0.64, Train aoc 0.68 | Valid Loss 0.023331 Valid acc 0.51, Valid aoc 0.57
Epoch 11 | Train Loss 0.019628, Train acc 0.64, Train aoc 0.68 | Valid Loss 0.023226 Valid acc 0.51, Valid aoc 0.57
Epoch 12 | Train Loss 0.019576, Train acc 0.66, Train aoc 0.69 | Valid Loss 0.023156 Valid acc 0.52, Valid aoc 0.57
Epoch 13 | Train Loss 0.019665, Train acc 0.64, Train aoc 0.69 | Valid Loss 0.023367 Valid acc 0.51, Valid aoc 0.56
Epoch 14 | Train Loss 0.019520, Train acc 0.66, Train aoc 0.69 | Valid Loss 0.023295 Valid acc 0.51, Valid aoc 0.57
Epoch 15 | Train Loss 0.019531, Train acc 0.66, Train aoc 0.70 | Valid Loss 0.023313 Valid acc 0.51, Valid aoc 0.57
Epoch 16 | Train Loss 0.019256, Train acc 0.69, Train aoc 0.70 | Valid Loss 0.023369 Valid acc 0.53, Valid aoc 0.57
Epoch 17 | Train Loss 0.019259, Train acc 0.69, Train aoc 0.71 | Valid Loss 0.023444 Valid acc 0.52, Valid aoc 0.57
Epoch 18 | Train Loss 0.019053, Train acc 0.69, Train aoc 0.71 | Valid Loss 0.023314 Valid acc 0.52, Valid aoc 0.57
Epoch 19 | Train Loss 0.019245, Train acc 0.68, Train aoc 0.72 | Valid Loss 0.023440 Valid acc 0.52, Valid aoc 0.57
