MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=10, bias=True)
      (linear2): Linear(in_features=10, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=10, bias=True)
    (linear2): Linear(in_features=10, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=10, out_features=10, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=10, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.020205, Train acc 0.64, Train aoc 0.62 | Valid Loss 0.020748 Valid acc 0.63, Valid aoc 0.52
Epoch 1 | Train Loss 0.018269, Train acc 0.69, Train aoc 0.75 | Valid Loss 0.020650 Valid acc 0.62, Valid aoc 0.56
Epoch 2 | Train Loss 0.017177, Train acc 0.73, Train aoc 0.78 | Valid Loss 0.021128 Valid acc 0.61, Valid aoc 0.56
Epoch 3 | Train Loss 0.016394, Train acc 0.74, Train aoc 0.80 | Valid Loss 0.021858 Valid acc 0.60, Valid aoc 0.56
Epoch 4 | Train Loss 0.015612, Train acc 0.76, Train aoc 0.82 | Valid Loss 0.022628 Valid acc 0.60, Valid aoc 0.56
Epoch 5 | Train Loss 0.014978, Train acc 0.76, Train aoc 0.84 | Valid Loss 0.023690 Valid acc 0.60, Valid aoc 0.56
Epoch 6 | Train Loss 0.014221, Train acc 0.78, Train aoc 0.85 | Valid Loss 0.024070 Valid acc 0.59, Valid aoc 0.55
