MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=10, bias=True)
      (linear2): Linear(in_features=10, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=10, bias=True)
    (linear2): Linear(in_features=10, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=10, out_features=10, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=10, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.020269, Train acc 0.64, Train aoc 0.57 | Valid Loss 0.020705 Valid acc 0.63, Valid aoc 0.53
Epoch 1 | Train Loss 0.020290, Train acc 0.64, Train aoc 0.59 | Valid Loss 0.020705 Valid acc 0.63, Valid aoc 0.54
Epoch 2 | Train Loss 0.019033, Train acc 0.67, Train aoc 0.71 | Valid Loss 0.020653 Valid acc 0.63, Valid aoc 0.56
Epoch 3 | Train Loss 0.017989, Train acc 0.68, Train aoc 0.78 | Valid Loss 0.020821 Valid acc 0.63, Valid aoc 0.56
Epoch 4 | Train Loss 0.017105, Train acc 0.69, Train aoc 0.82 | Valid Loss 0.020808 Valid acc 0.64, Valid aoc 0.58
Epoch 5 | Train Loss 0.015792, Train acc 0.74, Train aoc 0.83 | Valid Loss 0.021362 Valid acc 0.63, Valid aoc 0.58
Epoch 6 | Train Loss 0.015403, Train acc 0.73, Train aoc 0.85 | Valid Loss 0.021581 Valid acc 0.64, Valid aoc 0.58
Epoch 7 | Train Loss 0.014904, Train acc 0.74, Train aoc 0.86 | Valid Loss 0.021917 Valid acc 0.64, Valid aoc 0.58
Epoch 8 | Train Loss 0.014360, Train acc 0.75, Train aoc 0.87 | Valid Loss 0.022881 Valid acc 0.64, Valid aoc 0.57
Epoch 9 | Train Loss 0.013516, Train acc 0.79, Train aoc 0.88 | Valid Loss 0.023076 Valid acc 0.63, Valid aoc 0.56
Epoch 10 | Train Loss 0.012576, Train acc 0.81, Train aoc 0.90 | Valid Loss 0.023723 Valid acc 0.60, Valid aoc 0.57
Epoch 11 | Train Loss 0.013113, Train acc 0.81, Train aoc 0.89 | Valid Loss 0.024009 Valid acc 0.61, Valid aoc 0.55
Epoch 12 | Train Loss 0.011443, Train acc 0.82, Train aoc 0.91 | Valid Loss 0.026771 Valid acc 0.61, Valid aoc 0.55
Epoch 13 | Train Loss 0.010824, Train acc 0.82, Train aoc 0.92 | Valid Loss 0.028022 Valid acc 0.56, Valid aoc 0.55
Epoch 14 | Train Loss 0.010674, Train acc 0.82, Train aoc 0.92 | Valid Loss 0.031764 Valid acc 0.57, Valid aoc 0.56
Epoch 15 | Train Loss 0.010195, Train acc 0.83, Train aoc 0.93 | Valid Loss 0.032347 Valid acc 0.55, Valid aoc 0.55
Epoch 16 | Train Loss 0.009806, Train acc 0.84, Train aoc 0.93 | Valid Loss 0.033606 Valid acc 0.55, Valid aoc 0.55
Epoch 17 | Train Loss 0.009729, Train acc 0.84, Train aoc 0.94 | Valid Loss 0.039041 Valid acc 0.54, Valid aoc 0.55
Epoch 18 | Train Loss 0.009754, Train acc 0.84, Train aoc 0.94 | Valid Loss 0.050703 Valid acc 0.55, Valid aoc 0.55
Epoch 19 | Train Loss 0.009034, Train acc 0.85, Train aoc 0.94 | Valid Loss 0.055631 Valid acc 0.56, Valid aoc 0.55
