MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018251, Train acc 0.70, Train aoc 0.74 | Valid Loss 0.020561 Valid acc 0.63, Valid aoc 0.57
Epoch 1 | Train Loss 0.017095, Train acc 0.74, Train aoc 0.78 | Valid Loss 0.020776 Valid acc 0.61, Valid aoc 0.57
Epoch 2 | Train Loss 0.016283, Train acc 0.76, Train aoc 0.82 | Valid Loss 0.020436 Valid acc 0.62, Valid aoc 0.60
Epoch 3 | Train Loss 0.015472, Train acc 0.77, Train aoc 0.84 | Valid Loss 0.020640 Valid acc 0.63, Valid aoc 0.60
Epoch 4 | Train Loss 0.014383, Train acc 0.79, Train aoc 0.86 | Valid Loss 0.020903 Valid acc 0.63, Valid aoc 0.61
Epoch 5 | Train Loss 0.014075, Train acc 0.80, Train aoc 0.88 | Valid Loss 0.020815 Valid acc 0.63, Valid aoc 0.60
Epoch 6 | Train Loss 0.013321, Train acc 0.82, Train aoc 0.90 | Valid Loss 0.021402 Valid acc 0.62, Valid aoc 0.60
Epoch 7 | Train Loss 0.012681, Train acc 0.84, Train aoc 0.92 | Valid Loss 0.021751 Valid acc 0.61, Valid aoc 0.58
Epoch 8 | Train Loss 0.011088, Train acc 0.85, Train aoc 0.93 | Valid Loss 0.023327 Valid acc 0.61, Valid aoc 0.59
Epoch 9 | Train Loss 0.010507, Train acc 0.86, Train aoc 0.94 | Valid Loss 0.023896 Valid acc 0.61, Valid aoc 0.59
