MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=10, bias=True)
      (linear2): Linear(in_features=10, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=10, bias=True)
    (linear2): Linear(in_features=10, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=10, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=10, out_features=10, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=10, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.019911, Train acc 0.64, Train aoc 0.70 | Valid Loss 0.020648 Valid acc 0.63, Valid aoc 0.55
Epoch 1 | Train Loss 0.017629, Train acc 0.69, Train aoc 0.77 | Valid Loss 0.021226 Valid acc 0.62, Valid aoc 0.56
Epoch 2 | Train Loss 0.016553, Train acc 0.74, Train aoc 0.80 | Valid Loss 0.021456 Valid acc 0.61, Valid aoc 0.57
Epoch 3 | Train Loss 0.015626, Train acc 0.76, Train aoc 0.82 | Valid Loss 0.022428 Valid acc 0.60, Valid aoc 0.56
Epoch 4 | Train Loss 0.014701, Train acc 0.78, Train aoc 0.84 | Valid Loss 0.023626 Valid acc 0.59, Valid aoc 0.57
Epoch 5 | Train Loss 0.013973, Train acc 0.80, Train aoc 0.86 | Valid Loss 0.024742 Valid acc 0.60, Valid aoc 0.56
Epoch 6 | Train Loss 0.013312, Train acc 0.81, Train aoc 0.88 | Valid Loss 0.025030 Valid acc 0.58, Valid aoc 0.56
Epoch 7 | Train Loss 0.012545, Train acc 0.81, Train aoc 0.89 | Valid Loss 0.026922 Valid acc 0.57, Valid aoc 0.55
