MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9051, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018354, Train acc 0.70, Train aoc 0.74 | Valid Loss 0.020478 Valid acc 0.63, Valid aoc 0.57
Epoch 1 | Train Loss 0.016535, Train acc 0.74, Train aoc 0.79 | Valid Loss 0.021822 Valid acc 0.61, Valid aoc 0.55
Epoch 2 | Train Loss 0.016121, Train acc 0.75, Train aoc 0.83 | Valid Loss 0.021145 Valid acc 0.63, Valid aoc 0.58
Epoch 3 | Train Loss 0.014839, Train acc 0.78, Train aoc 0.85 | Valid Loss 0.021288 Valid acc 0.63, Valid aoc 0.59
Epoch 4 | Train Loss 0.014143, Train acc 0.80, Train aoc 0.87 | Valid Loss 0.021237 Valid acc 0.64, Valid aoc 0.59
Epoch 5 | Train Loss 0.013001, Train acc 0.81, Train aoc 0.89 | Valid Loss 0.021915 Valid acc 0.62, Valid aoc 0.59
Epoch 6 | Train Loss 0.012188, Train acc 0.82, Train aoc 0.90 | Valid Loss 0.024532 Valid acc 0.61, Valid aoc 0.59
Epoch 7 | Train Loss 0.011676, Train acc 0.84, Train aoc 0.92 | Valid Loss 0.022746 Valid acc 0.61, Valid aoc 0.60
Epoch 8 | Train Loss 0.010844, Train acc 0.84, Train aoc 0.93 | Valid Loss 0.027771 Valid acc 0.61, Valid aoc 0.58
Epoch 9 | Train Loss 0.009888, Train acc 0.86, Train aoc 0.94 | Valid Loss 0.029731 Valid acc 0.61, Valid aoc 0.59
Epoch 10 | Train Loss 0.009405, Train acc 0.88, Train aoc 0.95 | Valid Loss 0.028439 Valid acc 0.61, Valid aoc 0.58
Epoch 11 | Train Loss 0.008885, Train acc 0.88, Train aoc 0.96 | Valid Loss 0.040782 Valid acc 0.61, Valid aoc 0.57
Epoch 12 | Train Loss 0.008181, Train acc 0.89, Train aoc 0.96 | Valid Loss 0.041100 Valid acc 0.61, Valid aoc 0.58
