MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=10, bias=True)
      (linear2): Linear(in_features=10, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): Tanh()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): Tanh()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=10, bias=True)
    (linear2): Linear(in_features=10, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=10, bias=True)
      (1): Tanh()
      (2): Dropout(p=0.4, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=10, bias=True)
      (1): Tanh()
      (2): Dropout(p=0.4, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=10, out_features=10, bias=True)
    (1): Tanh()
    (2): Dropout(p=0.4, inplace=False)
    (3): Linear(in_features=10, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.019162, Train acc 0.68, Train aoc 0.68 | Valid Loss 0.020906 Valid acc 0.62, Valid aoc 0.53
Epoch 1 | Train Loss 0.017163, Train acc 0.73, Train aoc 0.77 | Valid Loss 0.021976 Valid acc 0.61, Valid aoc 0.55
Epoch 2 | Train Loss 0.016171, Train acc 0.75, Train aoc 0.80 | Valid Loss 0.022700 Valid acc 0.60, Valid aoc 0.56
Epoch 3 | Train Loss 0.015275, Train acc 0.77, Train aoc 0.83 | Valid Loss 0.023408 Valid acc 0.60, Valid aoc 0.56
Epoch 4 | Train Loss 0.014395, Train acc 0.79, Train aoc 0.85 | Valid Loss 0.024517 Valid acc 0.59, Valid aoc 0.55
Epoch 5 | Train Loss 0.013540, Train acc 0.81, Train aoc 0.87 | Valid Loss 0.025288 Valid acc 0.59, Valid aoc 0.55
Epoch 6 | Train Loss 0.012680, Train acc 0.83, Train aoc 0.89 | Valid Loss 0.026348 Valid acc 0.58, Valid aoc 0.55
Epoch 7 | Train Loss 0.011857, Train acc 0.84, Train aoc 0.90 | Valid Loss 0.027222 Valid acc 0.59, Valid aoc 0.55
Epoch 8 | Train Loss 0.011142, Train acc 0.84, Train aoc 0.91 | Valid Loss 0.028352 Valid acc 0.57, Valid aoc 0.55
Epoch 9 | Train Loss 0.010575, Train acc 0.85, Train aoc 0.92 | Valid Loss 0.029332 Valid acc 0.56, Valid aoc 0.54
