MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9403, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.8, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=100, out_features=100, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=100, out_features=100, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=100, out_features=100, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.8, inplace=False)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018892, Train acc 0.64, Train aoc 0.70 | Valid Loss 0.020766 Valid acc 0.63, Valid aoc 0.56
Epoch 1 | Train Loss 0.018320, Train acc 0.71, Train aoc 0.73 | Valid Loss 0.021327 Valid acc 0.60, Valid aoc 0.55
Epoch 2 | Train Loss 0.017855, Train acc 0.72, Train aoc 0.75 | Valid Loss 0.021474 Valid acc 0.60, Valid aoc 0.56
Epoch 3 | Train Loss 0.017450, Train acc 0.73, Train aoc 0.75 | Valid Loss 0.022179 Valid acc 0.60, Valid aoc 0.57
