MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(9051, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=100, bias=True)
      (linear2): Linear(in_features=100, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=True)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=100, bias=True)
    (linear2): Linear(in_features=100, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=100, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.4, inplace=True)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=100, out_features=100, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.4, inplace=True)
    (3): Linear(in_features=100, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018827, Train acc 0.68, Train aoc 0.71 | Valid Loss 0.020811 Valid acc 0.63, Valid aoc 0.55
Epoch 1 | Train Loss 0.017208, Train acc 0.74, Train aoc 0.78 | Valid Loss 0.020629 Valid acc 0.63, Valid aoc 0.58
Epoch 2 | Train Loss 0.016404, Train acc 0.76, Train aoc 0.81 | Valid Loss 0.020645 Valid acc 0.64, Valid aoc 0.59
Epoch 3 | Train Loss 0.015065, Train acc 0.77, Train aoc 0.84 | Valid Loss 0.021952 Valid acc 0.63, Valid aoc 0.59
