MainModel(
  (language_model): LanguageModel(
    (embed): Embedding(1, 25, padding_idx=0)
    (attention): Attention(
      (linear1): Linear(in_features=50, out_features=500, bias=True)
      (linear2): Linear(in_features=500, out_features=1, bias=True)
      (relu): ReLU()
      (softmax): Softmax(dim=1)
    )
  )
  (vision_model): VisionModel(
    (fc_layers): FCNet(
      (main): Sequential(
        (0): Linear(in_features=2048, out_features=2048, bias=True)
        (1): ReLU()
        (2): Dropout(p=0.2, inplace=True)
        (3): Linear(in_features=2048, out_features=2048, bias=True)
        (4): ReLU()
        (5): Dropout(p=0.2, inplace=False)
      )
    )
  )
  (attention): Attention(
    (linear1): Linear(in_features=2073, out_features=500, bias=True)
    (linear2): Linear(in_features=500, out_features=1, bias=True)
    (relu): ReLU()
    (softmax): Softmax(dim=1)
  )
  (vision_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=2048, out_features=500, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=False)
    )
  )
  (text_fcnet): FCNet(
    (main): Sequential(
      (0): Linear(in_features=25, out_features=500, bias=True)
      (1): ReLU()
      (2): Dropout(p=0.5, inplace=True)
      (3): Linear(in_features=500, out_features=500, bias=True)
      (4): ReLU()
      (5): Dropout(p=0.5, inplace=True)
      (6): Linear(in_features=500, out_features=500, bias=True)
      (7): ReLU()
      (8): Dropout(p=0.5, inplace=True)
      (9): Linear(in_features=500, out_features=500, bias=True)
      (10): ReLU()
      (11): Dropout(p=0.5, inplace=False)
    )
  )
  (classifier): Sequential(
    (0): Linear(in_features=500, out_features=500, bias=True)
    (1): ReLU()
    (2): Dropout(p=0.5, inplace=False)
    (3): Linear(in_features=500, out_features=1, bias=True)
  )
)
Epoch 0 | Train Loss 0.018189, Train acc 0.70, Train aoc 0.73 | Valid Loss 0.026984 Valid acc 0.52, Valid aoc 0.59
Epoch 1 | Train Loss 0.017539, Train acc 0.73, Train aoc 0.75 | Valid Loss 0.026261 Valid acc 0.54, Valid aoc 0.60
Epoch 2 | Train Loss 0.017290, Train acc 0.73, Train aoc 0.76 | Valid Loss 0.025264 Valid acc 0.54, Valid aoc 0.61
Epoch 3 | Train Loss 0.016818, Train acc 0.74, Train aoc 0.77 | Valid Loss 0.024213 Valid acc 0.55, Valid aoc 0.61
Epoch 4 | Train Loss 0.016839, Train acc 0.74, Train aoc 0.78 | Valid Loss 0.022963 Valid acc 0.55, Valid aoc 0.62
Epoch 5 | Train Loss 0.016797, Train acc 0.75, Train aoc 0.79 | Valid Loss 0.022972 Valid acc 0.56, Valid aoc 0.62
Epoch 6 | Train Loss 0.016302, Train acc 0.75, Train aoc 0.79 | Valid Loss 0.025375 Valid acc 0.56, Valid aoc 0.61
Epoch 7 | Train Loss 0.016298, Train acc 0.75, Train aoc 0.80 | Valid Loss 0.027509 Valid acc 0.54, Valid aoc 0.62
Epoch 8 | Train Loss 0.015920, Train acc 0.76, Train aoc 0.80 | Valid Loss 0.025326 Valid acc 0.55, Valid aoc 0.62
Epoch 9 | Train Loss 0.015737, Train acc 0.76, Train aoc 0.81 | Valid Loss 0.025708 Valid acc 0.54, Valid aoc 0.61
Epoch 10 | Train Loss 0.015624, Train acc 0.77, Train aoc 0.81 | Valid Loss 0.024308 Valid acc 0.56, Valid aoc 0.61
Epoch 11 | Train Loss 0.015694, Train acc 0.76, Train aoc 0.82 | Valid Loss 0.024446 Valid acc 0.54, Valid aoc 0.61
